# Generic Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Generic Class
Members See Also
---
A static class that provides access to the property names that appear in the Generic visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Generic
```

Visual Basic
---
```text
Public NotInheritable Class Generic
```

Visual C++
---
```text
public ref class Generic abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Generic
# See Also
Generic Members
Autodesk.Revit.DB.Visual Namespace